lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static const uint8_t k_local_demo_pct_sample[3] = {0x00U, 0x04U, 0x00U};
#if VPR_CS_DEDICATED_IMAGE
static uint16_t current_step_count_group(void);
static uint16_t current_channel_selection_group(void);
enum {
  VPR_CS_TONE_QUALITY_HIGH = 0x00U,
  VPR_CS_TONE_QUALITY_MEDIUM = 0x01U,
};
static const uint8_t k_peer_demo_pct_samples[39][3] = {
    {0xF0U, 0xB3U, 0xF4U}, {0xE2U, 0xC3U, 0xF0U}, {0xD1U, 0xE3U, 0xECU},
    {0xBCU, 0x13U, 0xE9U}, {0xA3U, 0x63U, 0xE5U}, {0x86U, 0xC3U, 0xE1U},
    {0x66U, 0x43U, 0xDEU}, {0x43U, 0xF3U, 0xDAU}, {0x1CU, 0xB3U, 0xD7U},
    {0xF2U, 0xB2U, 0xD4U}, {0xC4U, 0xD2U, 0xD1U}, {0x62U, 0xA2U, 0xCCU},
    {0x2DU, 0x52U, 0xCAU}, {0xF6U, 0x41U, 0xC8U}, {0xBDU, 0x61U, 0xC6U},
    {0x82U, 0xC1U, 0xC4U}, {0x46U, 0x51U, 0xC3U}, {0x08U, 0x31U, 0xC2U},
    {0xCAU, 0x40U, 0xC1U}, {0x8AU, 0x90U, 0xC0U}, {0x4AU, 0x30U, 0xC0U},
    {0x0AU, 0x00U, 0xC0U}, {0xC9U, 0x1FU, 0xC0U}, {0x89U, 0x7FU, 0xC0U},
    {0x4AU, 0x0FU, 0xC1U}, {0x0BU, 0xEFU, 0xC1U}, {0xCDU, 0xFEU, 0xC2U},
    {0x90U, 0x4EU, 0xC4U}, {0x55U, 0xDEU, 0xC5U}, {0x1BU, 0xAEU, 0xC7U},
    {0xE3U, 0xADU, 0xC9U}, {0xAEU, 0xEDU, 0xCBU}, {0x7AU, 0x5DU, 0xCEU},
    {0x4AU, 0xFDU, 0xD0U}, {0x1CU, 0xCDU, 0xD3U}, {0xF1U, 0xCCU, 0xD6U},
    {0xC9U, 0xFCU, 0xD9U}, {0xA4U, 0x4CU, 0xDDU}, {0x83U, 0xBCU, 0xE0U},
};

static int16_t clamp_pct12_component(int32_t value) {
  if (value < -2048) {
    return -2048;
  }
  if (value > 2047) {
    return 2047;
  }
  return (int16_t)value;
}

static int16_t decode_pct12_component(uint16_t bits) {
  return (int16_t)((bits ^ (1U << 11U)) - (1U << 11U));
}

static void decode_pct_sample_bytes(const uint8_t pct[3], int16_t *out_i, int16_t *out_q) {
  uint32_t packed = 0U;
  if (pct == NULL || out_i == NULL || out_q == NULL) {
    return;
  }
  packed = (uint32_t)pct[0] | ((uint32_t)pct[1] << 8U) | ((uint32_t)pct[2] << 16U);
  *out_i = decode_pct12_component((uint16_t)(packed & 0x0FFFU));
  *out_q = decode_pct12_component((uint16_t)((packed >> 12U) & 0x0FFFU));
}

static void encode_pct_sample_bytes(int16_t i, int16_t q, uint8_t out_pct[3]) {
  uint16_t i12 = 0U;
  uint16_t q12 = 0U;
  uint32_t packed = 0U;
  if (out_pct == NULL) {
    return;
  }
  i12 = (uint16_t)clamp_pct12_component(i) & 0x0FFFU;
  q12 = (uint16_t)clamp_pct12_component(q) & 0x0FFFU;
  packed = (uint32_t)i12 | ((uint32_t)q12 << 12U);
  out_pct[0] = (uint8_t)(packed & 0xFFU);
  out_pct[1] = (uint8_t)((packed >> 8U) & 0xFFU);
  out_pct[2] = (uint8_t)((packed >> 16U) & 0xFFU);
}

static void scale_pct_sample_bytes(const uint8_t input_pct[3], uint16_t scale_q10,
                                   uint8_t out_pct[3]) {
  int16_t i = 0;
  int16_t q = 0;
  int32_t scaled_i = 0;
  int32_t scaled_q = 0;
  if (input_pct == NULL || out_pct == NULL) {
    return;
  }
  decode_pct_sample_bytes(input_pct, &i, &q);
  scaled_i = ((int32_t)i * (int32_t)scale_q10 + 512) / 1024;
  scaled_q = ((int32_t)q * (int32_t)scale_q10 + 512) / 1024;
  encode_pct_sample_bytes(clamp_pct12_component(scaled_i),
                          clamp_pct12_component(scaled_q), out_pct);
}

static void rotate_pct_sample_bytes_quarter_turns(const uint8_t input_pct[3], uint8_t quarter_turns,
                                                  uint8_t out_pct[3]) {
  int16_t i = 0;
  int16_t q = 0;
  int16_t rotated_i = 0;
  int16_t rotated_q = 0;
  if (input_pct == NULL || out_pct == NULL) {
    return;
  }
  decode_pct_sample_bytes(input_pct, &i, &q);
  switch (quarter_turns & 0x03U) {
    case 0U:
      rotated_i = i;
      rotated_q = q;
      break;
    case 1U:
      rotated_i = clamp_pct12_component(-(int32_t)q);
      rotated_q = i;
      break;
    case 2U:
      rotated_i = clamp_pct12_component(-(int32_t)i);
      rotated_q = clamp_pct12_component(-(int32_t)q);
      break;
    default:
      rotated_i = q;
      rotated_q = clamp_pct12_component(-(int32_t)i);
      break;
  }
  encode_pct_sample_bytes(rotated_i, rotated_q, out_pct);
}

static uint16_t current_local_demo_scale_q10(uint8_t step_index) {
  uint16_t scale = ((step_index & 0x01U) != 0U) ? 736U : 896U;
  scale = (uint16_t)(scale + ((current_step_count_group() & 0x03U) * 32U));
  if (scale > 1024U) {
    scale = 1024U;
  }
  return scale;
}

static uint8_t current_local_demo_phase_quadrant(uint8_t step_index) {
  return (uint8_t)((current_step_count_group() + current_channel_selection_group() +
                    step_index) &
                   0x03U);
}

static uint16_t current_peer_demo_scale_q10(uint8_t channel, uint8_t step_index) {
  uint16_t attenuation = 0U;
  uint16_t channel_offset = 0U;
  int32_t scale = (int32_t)current_local_demo_scale_q10(step_index);

  if (g_cs_tx_power_delta < 0) {
    attenuation = (uint16_t)((uint8_t)(-g_cs_tx_power_delta) * 12U);
  }
  channel_offset =
      (uint16_t)(((channel + (uint8_t)current_channel_selection_group()) % 3U) * 24U);
  scale -= (int32_t)attenuation;
  scale += (int32_t)channel_offset - 24;
  if (scale < 512) {
    scale = 512;
  }
  if (scale > 1024) {
    scale = 1024;
  }
  return (uint16_t)scale;
}
#endif

static uint8_t current_demo_antenna_permutation(uint8_t step_index) {
  uint8_t count = g_cs_tone_antenna_config_selection;
  if (count == 0U) {
    count = 1U;
  }
  if (count > 4U) {
    count = 4U;
  }
  return (uint8_t)((current_step_count_group() + step_index) % count);
}

static void append_mode2_sample_step(uint8_t *dst, uint8_t channel, uint8_t permutation_index,
                                     uint8_t quality, const uint8_t pct[3]) {
  if (dst == NULL || pct == NULL) {
    return;
  }
  dst[0] = BLE_CS_MAIN_MODE2;
  dst[1] = channel;
  dst[2] = 5U;
  dst[3] = permutation_index;
  dst[4] = pct[0];
  dst[5] = pct[1];
  dst[6] = pct[2];
  dst[7] = (uint8_t)(quality & 0x0FU);
}

static size_t append_mode1_unavailable_step(uint8_t *dst, uint8_t channel,
                                            uint8_t packet_antenna) {
  if (dst == NULL) {
    return 0U;
  }
  dst[0] = BLE_CS_MAIN_MODE1;
  dst[1] = channel;
  dst[2] = 6U;
  dst[3] = 0xF2U;
  dst[4] = 0xFFU;
  dst[5] = 0x7FU;
  write_le16(&dst[6], 0x8000U);
  dst[8] = packet_antenna;
  return 9U;
}

