lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
  g_cs_config_id = slot->configId;
  g_cs_demo_channels_packed = slot->demoChannelsPacked;
  g_cs_main_mode_type = slot->mainModeType;
  g_cs_sub_mode_type = slot->subModeType;
  g_cs_min_main_mode_steps = slot->minMainModeSteps;
  g_cs_max_main_mode_steps = slot->maxMainModeSteps;
  g_cs_main_mode_repetition = slot->mainModeRepetition;
  g_cs_mode0_steps = slot->mode0Steps;
  g_cs_role = slot->role;
  g_cs_rtt_type = slot->rttType;
  g_cs_cs_sync_phy = slot->csSyncPhy;
  bytes_copy(g_cs_channel_map, slot->channelMap, sizeof(g_cs_channel_map));
  g_cs_channel_map_repetition = slot->channelMapRepetition;
  g_cs_channel_selection_type = slot->channelSelectionType;
  g_cs_ch3c_shape = slot->ch3cShape;
  g_cs_ch3c_jump = slot->ch3cJump;
  g_cs_enhancements1 = slot->enhancements1;
  g_cs_max_procedure_len = slot->maxProcedureLen;
  g_cs_min_procedure_interval = slot->minProcedureInterval;
  g_cs_max_procedure_interval = slot->maxProcedureInterval;
  g_cs_max_procedure_count = slot->maxProcedureCount;
  g_cs_min_subevent_len = slot->minSubeventLen;
  g_cs_max_subevent_len = slot->maxSubeventLen;
  g_cs_tone_antenna_config_selection = slot->toneAntennaConfigSelection;
  g_cs_phy = slot->phy;
  g_cs_tx_power_delta = slot->txPowerDelta;
  g_cs_config_created = 1U;
  g_cs_security_enabled = slot->securityEnabled;
  g_cs_procedure_params_applied = slot->procedureParamsApplied;
  return true;
}

static void store_active_create_state(vpr_cs_config_slot_t *slot) {
  if (slot == NULL) {
    return;
  }
  slot->inUse = 1U;
  slot->configId = g_cs_config_id;
  slot->demoChannelsPacked = g_cs_demo_channels_packed;
  slot->mainModeType = g_cs_main_mode_type;
  slot->subModeType = g_cs_sub_mode_type;
  slot->minMainModeSteps = g_cs_min_main_mode_steps;
  slot->maxMainModeSteps = g_cs_max_main_mode_steps;
  slot->mainModeRepetition = g_cs_main_mode_repetition;
  slot->mode0Steps = g_cs_mode0_steps;
  slot->role = g_cs_role;
  slot->rttType = g_cs_rtt_type;
  slot->csSyncPhy = g_cs_cs_sync_phy;
  bytes_copy(slot->channelMap, g_cs_channel_map, sizeof(slot->channelMap));
  slot->channelMapRepetition = g_cs_channel_map_repetition;
  slot->channelSelectionType = g_cs_channel_selection_type;
  slot->ch3cShape = g_cs_ch3c_shape;
  slot->ch3cJump = g_cs_ch3c_jump;
  slot->enhancements1 = g_cs_enhancements1;
  slot->securityEnabled = g_cs_security_enabled;
  slot->procedureParamsApplied = g_cs_procedure_params_applied;
}

static void store_active_procedure_state(vpr_cs_config_slot_t *slot) {
  if (slot == NULL) {
    return;
  }
  slot->maxProcedureLen = g_cs_max_procedure_len;
  slot->minProcedureInterval = g_cs_min_procedure_interval;
  slot->maxProcedureInterval = g_cs_max_procedure_interval;
  slot->maxProcedureCount = g_cs_max_procedure_count;
  slot->minSubeventLen = g_cs_min_subevent_len;
  slot->maxSubeventLen = g_cs_max_subevent_len;
  slot->toneAntennaConfigSelection = g_cs_tone_antenna_config_selection;
  slot->phy = g_cs_phy;
  slot->txPowerDelta = g_cs_tx_power_delta;
  slot->securityEnabled = g_cs_security_enabled;
  slot->procedureParamsApplied = g_cs_procedure_params_applied;
}

static void preserve_active_state_to_slot(void) {
  vpr_cs_config_slot_t *slot = NULL;
  if (g_cs_session_open == 0U || g_cs_config_created == 0U || g_cs_config_id == 0U) {
    return;
  }
  g_cs_previous_slot = (vpr_cs_config_slot_t){0};
  g_cs_previous_slot.inUse = 1U;
  store_active_create_state(&g_cs_previous_slot);
  store_active_procedure_state(&g_cs_previous_slot);
  slot = allocate_cs_slot(g_cs_config_id);
  if (slot == NULL) {
    return;
  }
  store_active_create_state(slot);
  store_active_procedure_state(slot);
}

static uint8_t fill_demo_channels_for_procedure(uint8_t *out_channels, uint8_t channel_count) {
  const uint32_t fallback_packed =
      (g_cs_demo_channels_packed != 0U) ? g_cs_demo_channels_packed : g_host_transport->reserved;
  uint8_t enabled[40];
  uint8_t count = 0U;
  uint8_t jump = 1U;
  uint8_t start = 0U;

  if (out_channels == NULL || channel_count == 0U) {
    return 0U;
  }

  for (uint8_t bit = 0U; bit < 40U; ++bit) {
    if (channel_map_bit_enabled(g_cs_channel_map, bit)) {
      enabled[count++] = bit;
    }
  }

  if (count == 0U) {
    for (uint8_t i = 0U; i < channel_count; ++i) {
      const uint8_t shift = (uint8_t)((i & 0x03U) * 8U);
      out_channels[i] = (uint8_t)((fallback_packed >> shift) & 0xFFU);
    }
    return channel_count;
  }

  if (g_cs_channel_selection_type == 1U && g_cs_ch3c_jump > 0U) {
    jump = g_cs_ch3c_jump;
  }
  start = (uint8_t)((current_channel_selection_group() * jump) % count);
  for (uint8_t i = 0U; i < channel_count; ++i) {
    out_channels[i] = enabled[(uint8_t)((start + i) % count)];
  }
  return channel_count;
}

static void update_demo_channels_from_create_config(void) {
  uint8_t channel_map[10];
  if (g_host_transport->hostLen < 32U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  bytes_copy(channel_map, (const void *)&g_host_transport->hostData[17], sizeof(channel_map));
  {
    const uint32_t packed = pack_demo_channels_from_map(channel_map);
    if (packed != 0U) {
      g_cs_demo_channels_packed = packed;
    }
  }
}

static void update_defaults_from_set_default_settings(void) {
  if (g_host_transport->hostLen < 9U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  g_cs_max_tx_power_dbm = (int8_t)g_host_transport->hostData[8];
}

static void update_create_config_from_command(void) {
  vpr_cs_config_slot_t *slot = NULL;
  if (g_host_transport->hostLen < 32U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  preserve_active_state_to_slot();
  g_cs_config_id = g_host_transport->hostData[6];
  g_cs_main_mode_type = g_host_transport->hostData[8];
  g_cs_sub_mode_type = g_host_transport->hostData[9];
  g_cs_min_main_mode_steps = g_host_transport->hostData[10];
  g_cs_max_main_mode_steps = g_host_transport->hostData[11];
  g_cs_main_mode_repetition = g_host_transport->hostData[12];
  g_cs_mode0_steps = g_host_transport->hostData[13];
  g_cs_role = g_host_transport->hostData[14];
  g_cs_rtt_type = g_host_transport->hostData[15];
  g_cs_cs_sync_phy = g_host_transport->hostData[16];
  bytes_copy(g_cs_channel_map, (const void *)&g_host_transport->hostData[17], sizeof(g_cs_channel_map));
  g_cs_channel_map_repetition = g_host_transport->hostData[27];
  g_cs_channel_selection_type = g_host_transport->hostData[28];
  g_cs_ch3c_shape = g_host_transport->hostData[29];
  g_cs_ch3c_jump = g_host_transport->hostData[30];
  g_cs_enhancements1 = g_host_transport->hostData[31];
  g_cs_config_created = 1U;
  g_cs_security_enabled = 0U;
  g_cs_procedure_params_applied = 0U;
  g_cs_procedure_enabled = 0U;
  g_pending_cs_result_stage = 0U;
  g_cs_procedure_counter = 0U;
  g_cs_next_procedure_heartbeat = 0U;
  g_cs_next_subevent_heartbeat = 0U;
  g_cs_next_peer_stage_heartbeat = 0U;
  g_cs_next_chunk_stage_heartbeat = 0U;
  g_cs_last_interval_selector = 0U;
  g_cs_last_peer_gap_ticks = 0U;
  g_cs_active_subevent_index = 0U;
  g_cs_local_chunk_start_step = 0U;
  g_cs_peer_chunk_start_step = 0U;
  update_demo_channels_from_create_config();
  slot = allocate_cs_slot(g_cs_config_id);
  if (slot != NULL) {
    store_active_create_state(slot);
    slot->securityEnabled = 0U;
    slot->procedureParamsApplied = 0U;
  }
}

static uint8_t validate_create_config_command(void) {
  const vpr_cs_config_slot_t *existing_slot = NULL;
  if (g_host_transport->hostLen < 32U || g_host_transport->hostData[0] != 0x01U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }

  const uint8_t config_id = g_host_transport->hostData[6];
  const uint8_t min_steps = g_host_transport->hostData[10];
  const uint8_t max_steps = g_host_transport->hostData[11];
  const uint8_t repetition = g_host_transport->hostData[12];
  const uint8_t mode0_steps = g_host_transport->hostData[13];
  const uint8_t cs_sync_phy = g_host_transport->hostData[16];

  if (config_id == 0U || min_steps == 0U || max_steps < min_steps ||
      repetition == 0U || mode0_steps == 0U || cs_sync_phy == 0U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!channel_map_has_enabled_channels((const uint8_t *)&g_host_transport->hostData[17])) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  existing_slot = find_cs_slot(config_id);
  if (existing_slot == NULL && !has_free_cs_slot()) {
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static void update_procedure_params_from_command(void) {
  vpr_cs_config_slot_t *slot = NULL;
  if (g_host_transport->hostLen < 27U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  g_cs_config_id = g_host_transport->hostData[6];
  g_cs_max_procedure_len = read_le16(&g_host_transport->hostData[7]);
  g_cs_min_procedure_interval = read_le16(&g_host_transport->hostData[9]);
  g_cs_max_procedure_interval = read_le16(&g_host_transport->hostData[11]);
  g_cs_max_procedure_count = read_le16(&g_host_transport->hostData[13]);
  g_cs_min_subevent_len = read_le24(&g_host_transport->hostData[15]);
  g_cs_max_subevent_len = read_le24(&g_host_transport->hostData[18]);
  g_cs_tone_antenna_config_selection = g_host_transport->hostData[21];
  g_cs_phy = g_host_transport->hostData[22];
  g_cs_tx_power_delta = (int8_t)g_host_transport->hostData[23];
  g_cs_procedure_params_applied = 1U;
  g_cs_next_procedure_heartbeat = 0U;
  g_cs_next_subevent_heartbeat = 0U;
  g_cs_next_peer_stage_heartbeat = 0U;
  g_cs_next_chunk_stage_heartbeat = 0U;
  g_cs_last_interval_selector = 0U;
  g_cs_last_peer_gap_ticks = 0U;
  g_cs_active_subevent_index = 0U;
  g_cs_local_chunk_start_step = 0U;
  g_cs_peer_chunk_start_step = 0U;
  slot = find_cs_slot(g_cs_config_id);
  if (slot == NULL && g_cs_config_created != 0U) {
    slot = allocate_cs_slot(g_cs_config_id);
    if (slot != NULL) {
      store_active_create_state(slot);
    }
  }
  if (slot != NULL) {
    store_active_procedure_state(slot);
  }
}

