lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static void clear_active_runtime_state(void) {
  g_cs_procedure_enabled = 0U;
  g_pending_cs_result_stage = 0U;
  g_cs_procedure_counter = 0U;
  g_cs_next_procedure_heartbeat = 0U;
  g_cs_next_subevent_heartbeat = 0U;
  g_cs_next_peer_stage_heartbeat = 0U;
  g_cs_next_chunk_stage_heartbeat = 0U;
  g_cs_last_interval_selector = 0U;
  g_cs_last_peer_gap_ticks = 0U;
  g_cs_active_subevent_index = 0U;
  g_cs_local_chunk_start_step = 0U;
  g_cs_peer_chunk_start_step = 0U;
}

static void clear_active_config_selection(void) {
  g_cs_config_created = 0U;
  g_cs_security_enabled = 0U;
  g_cs_procedure_params_applied = 0U;
  g_cs_config_id = 0U;
  g_cs_demo_channels_packed = 0U;
  clear_active_runtime_state();
}

static void clear_all_cs_state(void) {
  clear_active_config_selection();
  for (uint8_t i = 0U; i < (uint8_t)(sizeof(g_cs_slots) / sizeof(g_cs_slots[0])); ++i) {
    clear_cs_slot(&g_cs_slots[i]);
  }
  clear_cs_slot(&g_cs_previous_slot);
}

static void clear_active_cs_state(void) {
  clear_all_cs_state();
}

static uint8_t validate_remove_config_command(void) {
  const vpr_cs_config_slot_t *slot = NULL;
  const uint8_t requested_config_id =
      (g_host_transport->hostLen >= 7U) ? g_host_transport->hostData[6] : 0U;
  const bool active_config =
      (g_cs_config_created != 0U) && (requested_config_id == g_cs_config_id);
  if (g_host_transport->hostLen < 7U || g_host_transport->hostData[0] != 0x01U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (!any_cs_slot_in_use()) {
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  slot = find_cs_slot(g_host_transport->hostData[6]);
  if (slot == NULL && !active_config) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static uint8_t validate_security_enable_command(void) {
  if (g_host_transport->hostLen < 6U || g_host_transport->hostData[0] != 0x01U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_cs_config_created == 0U) {
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static uint8_t validate_set_procedure_params_command(void) {
  const vpr_cs_config_slot_t *slot = NULL;
  const uint8_t requested_config_id =
      (g_host_transport->hostLen >= 27U) ? g_host_transport->hostData[6] : 0U;
  const bool active_config =
      (g_cs_config_created != 0U) && (requested_config_id == g_cs_config_id);
  bool security_enabled = false;
  if (g_host_transport->hostLen < 27U || g_host_transport->hostData[0] != 0x01U) {
    g_vpr_transport->lastError = 0xD1U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    g_vpr_transport->lastError = (g_cs_session_open != 0U) ? 0xD2U : 0xD3U;
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  slot = find_cs_slot(g_host_transport->hostData[6]);
  if (slot == NULL && !active_config) {
    g_vpr_transport->lastError = 0xD6U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  security_enabled =
      (slot != NULL) ? (slot->securityEnabled != 0U) : (g_cs_security_enabled != 0U);
  if (g_cs_config_created == 0U || !security_enabled) {
    g_vpr_transport->lastError =
        (g_cs_config_created == 0U) ? 0xD4U : 0xD5U;
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  {
    const uint16_t max_procedure_len = read_le16(&g_host_transport->hostData[7]);
    const uint16_t min_interval = read_le16(&g_host_transport->hostData[9]);
    const uint16_t max_interval = read_le16(&g_host_transport->hostData[11]);
    const uint16_t max_count = read_le16(&g_host_transport->hostData[13]);
    const uint32_t min_subevent_len = read_le24(&g_host_transport->hostData[15]);
    const uint32_t max_subevent_len = read_le24(&g_host_transport->hostData[18]);
    if (max_procedure_len == 0U || min_interval == 0U || max_interval < min_interval ||
        max_count == 0U || min_subevent_len == 0U ||
        max_subevent_len < min_subevent_len) {
      g_vpr_transport->lastError = 0xD7U;
      return BLE_CS_HCI_STATUS_INVALID_PARAMS;
    }
  }
  g_vpr_transport->lastError = 0U;
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static uint8_t validate_procedure_enable_command(void) {
  const vpr_cs_config_slot_t *slot = NULL;
  const uint8_t requested_config_id =
      (g_host_transport->hostLen >= 8U) ? g_host_transport->hostData[6] : 0U;
  const bool active_config =
      (g_cs_config_created != 0U) && (requested_config_id == g_cs_config_id);
  bool security_enabled = false;
  bool procedure_params_applied = false;
  if (g_host_transport->hostLen < 8U || g_host_transport->hostData[0] != 0x01U) {
    g_vpr_transport->lastError = 0xE1U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    g_vpr_transport->lastError = (g_cs_session_open != 0U) ? 0xE2U : 0xE3U;
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_cs_config_created == 0U) {
    g_vpr_transport->lastError = 0xE4U;
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  slot = find_cs_slot(g_host_transport->hostData[6]);
  if (slot == NULL && !active_config) {
    g_vpr_transport->lastError = 0xE5U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  security_enabled =
      (slot != NULL) ? (slot->securityEnabled != 0U) : (g_cs_security_enabled != 0U);
  procedure_params_applied =
      (slot != NULL) ? (slot->procedureParamsApplied != 0U)
                     : (g_cs_procedure_params_applied != 0U);
  if (g_host_transport->hostData[7] > 1U) {
    g_vpr_transport->lastError = 0xE6U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (g_host_transport->hostData[7] == 0U) {
    if (g_host_transport->hostData[6] != g_cs_config_id) {
      g_vpr_transport->lastError = 0xE5U;
      return BLE_CS_HCI_STATUS_INVALID_PARAMS;
    }
    g_vpr_transport->lastError = 0U;
    return BLE_CS_HCI_STATUS_SUCCESS;
  }
  if (!security_enabled || !procedure_params_applied) {
    g_vpr_transport->lastError =
        (!security_enabled) ? 0xE7U : 0xE8U;
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  g_vpr_transport->lastError = 0U;
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static uint8_t validate_read_remote_caps_command(void) {
  if (g_host_transport->hostLen < 6U || g_host_transport->hostData[0] != 0x01U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (g_cs_session_open == 0U) {
    return BLE_CS_HCI_STATUS_SUCCESS;
  }
  return (read_conn_handle() == g_cs_session_conn_handle) ? BLE_CS_HCI_STATUS_SUCCESS
                                                          : BLE_CS_HCI_STATUS_INVALID_PARAMS;
}

static uint32_t current_procedure_interval_ticks(void) {
  const uint32_t min_ticks =
      (g_cs_min_procedure_interval != 0U) ? (uint32_t)g_cs_min_procedure_interval : 1U;
  const uint32_t max_ticks =
      (g_cs_max_procedure_interval >= g_cs_min_procedure_interval &&
       g_cs_max_procedure_interval != 0U)
          ? (uint32_t)g_cs_max_procedure_interval
          : min_ticks;
  if (max_ticks <= min_ticks) {
    g_cs_last_interval_selector = 0U;
    return min_ticks;
  }
  if (g_cs_max_procedure_count <= 2U || g_cs_procedure_counter <= 1U) {
    g_cs_last_interval_selector = 0U;
    return min_ticks;
  }
  const uint32_t gap_index = (uint32_t)g_cs_procedure_counter - 1U;
  const uint32_t gap_span = (uint32_t)g_cs_max_procedure_count - 2U;
  uint32_t selector = (gap_index * 15U + (gap_span / 2U)) / gap_span;
  if (selector > 15U) {
    selector = 15U;
  }
  g_cs_last_interval_selector = (uint8_t)selector;
  return min_ticks + (((max_ticks - min_ticks) * selector + 7U) / 15U);
}

